<?php

namespace Database\Seeders;

use App\Models\Page;
use Illuminate\Database\Seeder;

class PageSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        Page::truncate();
        Page::create([
            'slug' => 'privacy-policy',
            'title' => [
                'en' => 'Privacy Policy',
                'ar' => 'سياسة الخصوصية'
            ],
            'content' => [
                'en' => '<p> privacy policy </p>',
                'ar' => '<div class="container ">
                            <h6 class="text-primary pb-4"> سياسة الخصوصية وسرية المعلومات </h6>
                            <p> يرحّب بكم متجر فليكس... وفقاً لآلية سياسة الخصوصية وسرية المعلومات المعمول بها في متجر فليكس . </p>
                            <p class="py-4"> أولاً: المعلومات التي يحصل عليها متجر فليكس ويحتفظ بها في قواعد بياناته </p>
                            <p> المعلومات الشخصية الخاصة بالمستخدم... </p>
                            <p> معلومات الدخول الشخصية الخاصة بالمستخدم... </p>
                            <p> قد تفرض طبيعة المنصة الالكترونية بعض المعلومات المتعلّقة بالكوكيز... </p>
                            <p class="py-4"> ثانياً: هل متجر فليكس تشارك هذه المعلومات؟ </p>
                            <p> تسعى بالاحتفاظ بهذه المعلومات بما يحفظ خصوصية المستخدم... </p>
                            <p class="py-4"> ثالثاً: ما هو مدى أمان سرية المعلومات الخاصة بالمتجر؟ </p>
                            <p> تسعى متجر فليكس إلى سرية المعلومات... </p>
                            <p class="py-4"> رابعاً: هل هناك طرف ثالث في العلاقة بين متجر فليكس والتاجر؟ </p>
                            <p> تحدد هنا سياسة الخصوصية فيما يتعلّق بالحالات التي يكون هناك طرفاً ثالث... </p>
                            <p class="py-4"> خامساً: قواعد وأحكام استخدام متجر فليكس : </p>
                            <p> إن جميع التزامات متجر فليكس، وجميع التزامات المستخدمين... </p>
                        </div>'
            ],
            'status' => 1,  // Assuming this field is for status, set it as needed
            'created_at' => now(),
            'updated_at' => now(),
        ]);

        Page::create([
            'slug' => 'replacement-policy',
            'title' => [
                'en' => 'Replacement & Refund Policy',
                'ar' => 'سياسة الاستبدال والإسترجاع'
            ],
            'content' => [
                'en' => '<p> replacement and refund policy content .</p>',
                'ar' => '<div class="container">
                            <h6 class="text-primary pb-4">سياسة الاستبدال والإسترجاع بموقعنا:</h6>
                            <p>1- نحن فقط موزعين اكواد واشتراكات رقمية مشحونة عبر بطاقات (gift card) ولسنا مطورين ومبرمجين لأي من الخدمات التي نقوم ببيعها.</p>
                            <p>2- الأكواد والأشتراكات المباعة ترد او تستبدل فقط في حال كان هناك خلل من طرفنا ولم نستطيع اصلاحه.</p>
                            <p>3- تنتهي مسؤولية الموقع عند تفعيل الأكواد او الأشتراكات المباعة إلا في حال تم التوضيح بوصف المنتج انه يوجد ضمان على المنتج.</p>
                            <p>4- الضمان الذهبي يتم ارجاع دبل المبلغ في حال خرب الحساب وماقدرنا نرجعه نفسه فقط.</p>
                            <p>5- شراء اي منتج من موقعنا هذا يعني أنك قمت بموافقة كل الشروط الموجودة في الموقع.</p>
                        </div>'
            ],
            'status' => 1,  // Assuming this field is for status, set it as needed
            'created_at' => now(),
            'updated_at' => now(),
        ]);
    }
}
